sudo nano ~/.bashrc
source ~/.bashrc



db.posts.insert({ title: 'Идеи из фетра – поделки своими руками: фото и видео для творчества', description: 'Тема статьи «Идеи из фетра». В одном месте собраны новогодние и развивающие идеи для поделок из фетра своими руками. Фото идей игрушек для детей.', heading: 'Идеи поделок из фетра', content: '<p>Совсем недавно я бродила по сети в поисках вдохновения, и на одном из англоязычных сайтов мне попалась большая статья по теме идеи из фетра. Выполненные из данного материала изделия были разными по сложности выполнения, детализации и имели различные потребительские свойства. Я даже не подозревала, что фетр настолько популярен в среде рукодельниц. Я решила сделать свою подборку.</p><p>Процесс производства фетра напоминает собой изготовление бумаги. Он является волокнистым материалом, поэтому его возможно не только резать и шить, как большинство тканей, но и клеить, гнуть и складывать.</p><p>Популярность фетра можно объяснить его отличительной особенностью от других тканей. Ведь он отлично сочетается с различными материалами и фурнитурой. За счет такой его функциональности в голову приходят довольно интересные идеи поделок из фетра, которые легко воплотить в жизнь своими руками при наличии терпения и небольшого количества свободного времени для творчества.</p><h2>Новогодние идеи из фетра</h2><p>Приближается Новый год – замечательный праздник. Впереди нас ждут длинные каникулы и появляется возможность не отвлекаться на рабочую суету, посвятив себя творчеству. Подобными поделками можно украсить подарочную упаковку, поздравительные открытки, новогодний венок на двери или сделать составляющей частью сервировки праздничного стола. Давайте рассмотрим некоторые идеи как использовать фетр на Новый год.</p>', difficulty: 1, сover: 'https://podelkirukamy.ru/wp-content/uploads/2016/12/idei-iz-fetra.jpg', status: 'published', createdAt: '2016-12-20T17:26:05.598Z', publishedAt: '2016-12-20T17:26:05.598Z', updatetAt: '2016-12-21T04:48:24.598Z', category: '5d9e5d26128cf652a0c49940', owner: '5d9e59a4b00a74c0f3ed0433' })

db.categories.insert({ status: 'published', title: 'Поделки из фетра', description: 'Научитесь создавать красивые изделия из самого приятного материала для творчества.', heading: 'Поделки из фетра', content: '&lt;p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque bibendum eros ac est mollis pretium. Ut ipsum ex, accumsan quis tellus at, laoreet venenatis arcu. Aliquam erat volutpat. Praesent malesuada, erat sed posuere dapibus, arcu lacus finibus quam, eu egestas tellus nulla nec justo.&lt;/p>', cover: 'felt-jpg-1569704711495.jpeg', owner: '5d9e59a4b00a74c0f3ed0433', createdAt: '2019-08-29T20:55:59.711+00:00', slug: 'podelki-iz-fetra', updatetAt: '2019-09-28T21:05:27.865+00:00', publishedAt: '2019-09-28T21:05:22.919+00:00' })

db.categories.insert({ status: 'published', title: 'Новогодние поделки', description: 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque...', heading: 'Поделки на Новый Год', content: '&lt;p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque bibendum eros ac est mollis pretium. Ut ipsum ex, accumsan quis tellus at, laoreet venenatis arcu. Aliquam erat volutpat. Praesent malesuada, erat sed posuere dapibus, arcu lacus finibus quam, eu egestas tellus nulla nec justo.&lt;/p>', cover: '696-jpg-1569704989590.jpeg', owner: '5d9e59a4b00a74c0f3ed0433', createdAt: '2019-08-30T04:09:48.756+00:00', slug: 'podelki-na-novyj-god', updatetAt: '2019-09-28T21:30:17.436+00:00', publishedAt: '2019-09-28T21:30:12.069+00:00' })

db.categories.insert({ status: 'published', title: 'Поделки на День Святого Валентина своими руками - каталок идей', description: 'Найдите и сохраните идеи про удивительные поделки на День Святого Валентина своими руками. Узнайте больше о подарках на День влюбленных для неё и для него.', heading: 'Поделки на День Святого Валентина', content: '&lt;p>Каждый год влюбленные во всем мире дарят друг другу цветы, подарки и поделки на День Святого Валентина, обмениваются валентинками и письмами. Они даже могут устроить романтический ужин в ресторане или провести ночь в отеле, отстранившись от обыденного интерьера. Неважно, насколько человек романтичный, творческий или веселый, все иногда нуждаются в помощи. Если вы читаете эту статью, наверняка, вы хотите удивить свою вторую половинку чем-то новым. Постараемся помочь вам в этом.&lt;/p>&lt;p>&lt;strong>Какие можно сделать поделки на День Святого Валентина своими руками:&lt;/strong>&lt;/p>', cover: '2646901-jpg-1569705008174.jpeg', owner: '5d9e59a4b00a74c0f3ed0433', createdAt: '2019-08-30T04:09:48.756+00:00', slug: 'den-svyatogo-valentina', updatetAt: '2019-09-28T21:30:17.436+00:00', publishedAt: '2019-09-28T21:30:12.069+00:00' })


db.posts.insert({ title: 'Идеи из фетра – поделки своими руками', description: 'В одном месте собраны новогодние и развивающие идеи для поделок из фетра своими руками. Фото идей игрушек для детей.', heading: 'Идеи поделок из фетра 2', content: '<p>Совсем недавно я бродила по сети в поисках вдохновения, и на одном из англоязычных сайтов мне попалась большая статья по теме идеи из фетра. Выполненные из данного материала изделия были разными по сложности выполнения, детализации и имели различные потребительские свойства. Я даже не подозревала, что фетр настолько популярен в среде рукодельниц. Я решила сделать свою подборку.</p><p>Процесс производства фетра напоминает собой изготовление бумаги. Он является волокнистым материалом, поэтому его возможно не только резать и шить, как большинство тканей, но и клеить, гнуть и складывать.</p><p>Популярность фетра можно объяснить его отличительной особенностью от других тканей. Ведь он отлично сочетается с различными материалами и фурнитурой. За счет такой его функциональности в голову приходят довольно интересные идеи поделок из фетра, которые легко воплотить в жизнь своими руками при наличии терпения и небольшого количества свободного времени для творчества.</p><h2>Новогодние идеи из фетра</h2><p>Приближается Новый год – замечательный праздник. Впереди нас ждут длинные каникулы и появляется возможность не отвлекаться на рабочую суету, посвятив себя творчеству. Подобными поделками можно украсить подарочную упаковку, поздравительные открытки, новогодний венок на двери или сделать составляющей частью сервировки праздничного стола. Давайте рассмотрим некоторые идеи как использовать фетр на Новый год.</p>', difficulty: 1, сover: 'https://podelkirukamy.ru/wp-content/uploads/2016/12/idei-iz-fetra.jpg', status: 'published', createdAt: '2016-12-20T17:26:05.598Z', publishedAt: '2016-12-20T17:26:05.598Z', updatetAt: '2016-12-21T04:48:24.598Z', category: '5d9e5d26128cf652a0c49940', owner: '5d9e59a4b00a74c0f3ed0433' })


db.posts.insert({ views: 1255, likes: 39, title: 'Объемная елка из фетра своими руками – выкройки и шаблоны внутри', description: 'Объемная елка из фетра является замечательной частью новогоднего декора. Научитесь по мастер-классу делать их своими руками, как для себя, так и для детей.', heading: 'Объемная елка из фетра', content: '<p>Совсем недавно я бродила по сети в поисках вдохновения, и на одном из англоязычных сайтов мне попалась большая статья по теме идеи из фетра. Выполненные из данного материала изделия были разными по сложности выполнения, детализации и имели различные потребительские свойства. Я даже не подозревала, что фетр настолько популярен в среде рукодельниц. Я решила сделать свою подборку.</p><p>Процесс производства фетра напоминает собой изготовление бумаги. Он является волокнистым материалом, поэтому его возможно не только резать и шить, как большинство тканей, но и клеить, гнуть и складывать.</p><p>Популярность фетра можно объяснить его отличительной особенностью от других тканей. Ведь он отлично сочетается с различными материалами и фурнитурой. За счет такой его функциональности в голову приходят довольно интересные идеи поделок из фетра, которые легко воплотить в жизнь своими руками при наличии терпения и небольшого количества свободного времени для творчества.</p><h2>Новогодние идеи из фетра</h2><p>Приближается Новый год – замечательный праздник. Впереди нас ждут длинные каникулы и появляется возможность не отвлекаться на рабочую суету, посвятив себя творчеству. Подобными поделками можно украсить подарочную упаковку, поздравительные открытки, новогодний венок на двери или сделать составляющей частью сервировки праздничного стола. Давайте рассмотрим некоторые идеи как использовать фетр на Новый год.</p>', difficulty: 1, сover: 'obuemnaya-elka-iz-fetra-cover', status: 'published', createdAt: '2016-12-22T22:25:51.598+00:00', publishedAt: '2016-12-22T22:25:51.598+00:00', updatetAt: '2019-08-28T11:19:36.367+00:00', category: '5d9e5d26128cf652a0c49940', owner: '5d9e59a4b00a74c0f3ed0433', slug: 'obuemnaya-elka-iz-fetra' })


db.createUser({ user: "mongo-admin", pwd: "sP8wDYFDgjhbr5edb", roles: [ { role: "userAdminAnyDatabase", db: "admin" } ] })

db.createUser(
  {
    user: "kontuzh-craft",
    pwd: "wmWIRGeA2yC3fabm",
    roles: [ { role: "root", db: "admin" } ]
  }
)


use admin

db.auth("mongo-admin", "sP8wDYFDgjhbr5edb" )

mongo --port 27017 -u mongo-admin --authenticationDatabase 'owlcrafts' -p


use owlcrafts
db.createUser(
  {
    user: "kontuzh",
    pwd: "sP8wgjhbDr5edYFDb",
    roles: [
       { role: "read", db: "reporting" },
       { role: "readWrite", db: "owlcrafts" }
    ]
  }
)

sudo nano /etc/mongod.conf
sudo service mongod restart

mongo
use owlcrafts
db.auth("kontuzh", "sP8wgjhbDr5edYFDb" )


db.customers.updateOne( { email: 'main-kaif-forever@yandex.ru' }, { $set: { role: 'admin' }}, { multi: True } )
db.users.updateOne( { "_id": ObjectId("5d9e59a4b00a74c0f3ed0433") }, { $set: { "role" : "admin" }} )